Revit 2027 API
TopographySurface.ArePointsDistinct Method
 Identify whether the input points are distinct in XY location.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ArePointsDistinct(
	IList<XYZ> points
)
Public Shared Function ArePointsDistinct (
	points As IList(Of XYZ)
) As Boolean
public:
static bool ArePointsDistinct(
	IList<XYZ^>^ points
)
static member ArePointsDistinct :
        points : IList<XYZ> -> bool
Parameters
points IList<XYZ>
 The points set to be checked.
Return Value
Boolean
 True if all points are distinct after ignoring the elevations, otherwise false.
Exceptions
Exception | Condition
ArgumentException |  There are no points in the input points set.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace